{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "finetuning_task": "ner",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-AGE_90_PLUS",
    "2": "B-CONTACT",
    "3": "B-DATE",
    "4": "B-ID",
    "5": "B-LOCATION",
    "6": "B-NAME",
    "7": "B-OTHER",
    "8": "B-PROFESSION",
    "9": "I-AGE_90_PLUS",
    "10": "I-CONTACT",
    "11": "I-DATE",
    "12": "I-ID",
    "13": "I-LOCATION",
    "14": "I-NAME",
    "15": "I-OTHER",
    "16": "I-PROFESSION"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-AGE_90_PLUS": 1,
    "B-CONTACT": 2,
    "B-DATE": 3,
    "B-ID": 4,
    "B-LOCATION": 5,
    "B-NAME": 6,
    "B-OTHER": 7,
    "B-PROFESSION": 8,
    "I-AGE_90_PLUS": 9,
    "I-CONTACT": 10,
    "I-DATE": 11,
    "I-ID": 12,
    "I-LOCATION": 13,
    "I-NAME": 14,
    "I-OTHER": 15,
    "I-PROFESSION": 16,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50000
}
